In [2]:
import numpy
numpy.__version__

'1.17.2'

In [5]:
import scipy
scipy.__version__

'1.3.1'

In [4]:
import pandas
pandas.__version__

'0.25.1'

In [6]:
import matplotlib
matplotlib.__version__

'3.1.1'

# Машинное обучение и анализ данных

## Математика и Python

Задание 1

In [1]:
import pandas as pd

In [5]:
frame = pd.DataFrame({'num':range(10), 'chars':['a']*10})

In [3]:
frame

   num chars
0    0     a
1    1     a
2    2     a
3    3     a
4    4     a
5    5     a
6    6     a
7    7     a
8    8     a
9    9     a

In [8]:
new_line = {'num':'7,5', 'chars':'b'}

In [11]:
frame = frame.append(new_line, ignore_index=True)

In [12]:
frame

    num chars
0     0     a
1     1     a
2     2     a
3     3     a
4     4     a
5     5     a
6     6     a
7     7     a
8     8     a
9     9     a
10  7,5     b

In [14]:
frame['another col'] = [i+10 for i in range(11)]

In [15]:
frame

    num chars  another col
0     0     a           10
1     1     a           11
2     2     a           12
3     3     a           13
4     4     a           14
5     5     a           15
6     6     a           16
7     7     a           17
8     8     a           18
9     9     a           19
10  7,5     b           20

In [26]:
frame.drop([9,10], axis = 0, inplace = True)

In [27]:
frame

  num chars  another col
0   0     a           10
1   1     a           11
2   2     a           12
3   3     a           13
4   4     a           14
5   5     a           15
6   6     a           16
7   7     a           17
8   8     a           18

In [28]:
frame.drop('another col', axis = 1, inplace = True)

In [29]:
frame

  num chars
0   0     a
1   1     a
2   2     a
3   3     a
4   4     a
5   5     a
6   6     a
7   7     a
8   8     a

In [34]:
frame.to_csv('frame_file.csv', sep=',', header=True, index=None)

In [35]:
!cat frame_file.csv

num,chars
0,a
1,a
2,a
3,a
4,a
5,a
6,a
7,a
8,a

In [137]:
frame = pd.read_csv('_62e88c592115ea3459114560893e5ef6_dataset.tsv', sep='\t', header=0)

In [138]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [139]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [140]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [141]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [142]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 320.0+ bytes

In [143]:
frame.fillna('', inplace=True)

In [144]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [136]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [75]:
frame[['Name','Position']][1:4]

              Name      Position
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий

In [76]:
frame.loc[[1,3,5],['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [79]:
frame.iloc[[1,3,5], [0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [95]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City == 'Москва')]

           Name      Birth    City Position
4   Рыбина Е.П. 1985-11-19  Москва  инженер
5  Костров С.О. 1985-05-31  Москва   стажер

In [98]:
frame.size

24

In [113]:
frame['123'] = 1,2,3,4,5,6

In [114]:
frame

              Name      Birth       City      Position  123
0      Иванов А.А. 1980-03-22     Москва  разнорабочий    1
1     Сорокин И.В. 1965-07-08  Волгоград       инженер    2
2       Белов М.М. 1980-02-13     Ростов      менеджер    3
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий    4
4      Рыбина Е.П. 1985-11-19     Москва       инженер    5
5     Костров С.О. 1985-05-31     Москва        стажер    6

In [115]:
import numpy as np

In [117]:
type([5, 5])

list

In [127]:
a = np.random.rand(4,5)

In [128]:
type(a)

numpy.ndarray

In [133]:
a[3:4]

array([[0.58051163, 0.10184818, 0.42289088, 0.75509328, 0.33649032]])

In [145]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    6 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 320.0+ bytes